# 第4章 データを部分的に参照しよう

In [1]:
import pandas as pd
import numpy as np

---

## 4.1 データの先頭を取得するには

In [2]:
df = pd.DataFrame(
    [
        ["Alice", "国語", 87],
        ["Alice", "数学", 72],
        ["Bob", "国語", 65],
        ["Bob", "数学", 92],
    ],
    columns=["Name", "Subject", "Point"],
)
df

    Name Subject  Point
0  Alice      国語     87
1  Alice      数学     72
2    Bob      国語     65
3    Bob      数学     92

### やってみよう

In [3]:
df.head(2)

    Name Subject  Point
0  Alice      国語     87
1  Alice      数学     72

---

## 4.2 データを1列おきに取得するには

In [4]:
df = pd.DataFrame(
    [
        [100, 10, 10, 15, 15],
        [101, 7, 17, 12, 27],
        [102, 5, 22, 18, 45],
    ],
    columns=["No", "Sales_A", "Cum_A", "Sales_B", "Cum_B"],
)
df

    No  Sales_A  Cum_A  Sales_B  Cum_B
0  100       10     10       15     15
1  101        7     17       12     27
2  102        5     22       18     45

### やってみよう

In [11]:
df.iloc[:,::-1]

   Cum_B  Sales_B  Cum_A  Sales_A   No
0     15       15     10       10  100
1     27       12     17        7  101
2     45       18     22        5  102

---

## 4.3 条件で行を絞り込むには

In [12]:
df = pd.DataFrame(
    [
        ["Alice", "国語", 87],
        ["Alice", "数学", 72],
        ["Bob", "国語", 65],
        ["Bob", "数学", 92],
    ],
    columns=["Name", "Subject", "Point"],
)
df

    Name Subject  Point
0  Alice      国語     87
1  Alice      数学     72
2    Bob      国語     65
3    Bob      数学     92

### やってみよう

In [13]:
df[df["Subject"]=="数学"]

    Name Subject  Point
1  Alice      数学     72
3    Bob      数学     92

In [15]:
df[pd.Series([c == "数学" for c in df.Subject])]

    Name Subject  Point
1  Alice      数学     72
3    Bob      数学     92

---

## 4.4 一部の列を取得するには

In [16]:
df = pd.DataFrame(
    [
        ["Alice", "国語", 87],
        ["Alice", "数学", 72],
        ["Bob", "国語", 65],
        ["Bob", "数学", 92],
    ],
    columns=["Name", "Subject", "Point"],
)
df

    Name Subject  Point
0  Alice      国語     87
1  Alice      数学     72
2    Bob      国語     65
3    Bob      数学     92

### やってみよう

In [20]:
df.loc[0:2,["Name","Subject"]]

    Name Subject
0  Alice      国語
1  Alice      数学
2    Bob      国語

---

## 4.5 1列だけのDataFrameを作成するには

In [21]:
df = pd.DataFrame(
    [
        ["Alice", "国語", 87],
        ["Alice", "数学", 72],
        ["Bob", "国語", 65],
        ["Bob", "数学", 92],
    ],
    columns=["Name", "Subject", "Point"],
)
df

    Name Subject  Point
0  Alice      国語     87
1  Alice      数学     72
2    Bob      国語     65
3    Bob      数学     92

### やってみよう

In [25]:
display(df[["Name"]])
display(type(df[["Name"]]))
display(df["Name"])
display(type(df["Name"]))

    Name
0  Alice
1  Alice
2    Bob
3    Bob

pandas.core.frame.DataFrame

0    Alice
1    Alice
2      Bob
3      Bob
Name: Name, dtype: object

pandas.core.series.Series

In [28]:
sr = df["Name"]
display(type(sr))
display(sr.to_frame())
display(type(sr.to_frame()))

pandas.core.series.Series

    Name
0  Alice
1  Alice
2    Bob
3    Bob

pandas.core.frame.DataFrame